holly_LRR_kigherKvisc-newt/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    courseFace
    {
        type            calculated;
        value           uniform 0;
    }
    courseCyclicBoundary
    {
        type            cyclicAMI;
    }
    courseWalls
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    freeBoundaryCourse
    {
        type            calculated;
        value           uniform 0;           
    }
    courseSymmetryWalls
    {
        type            symmetryPlane;
    }
    fineSymmetryWall
    {
        type            symmetryPlane;
    }
    fineWalls
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    fineCyclicBoundary
    {
        type            cyclicAMI;
    }
    fineplug
    {
        type            cyclicAMI;
    }
    faceFine
    {
        type            calculated;
        value           uniform 0;
    }
    inletFace
    {
        type            calculated;
        value           uniform 0;
    }
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    inletWalls
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    outletInlet
    {
        type            cyclicAMI;
    }



 






}


// ************************************************************************* //
